breadcrumbs-api/app/controllers/trails_controller.rb

SELECT "trails".* FROM "trails"
---
  def index
    @trails = Trail.all

SELECT "trails".* FROM "trails" WHERE "trails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_trail
      @trail = Trail.find(params[:id])